// Filter + Map + forEach + Reduce — ნიშნების ანალიზი

// მოცემულია ნიშნების მასივი 0-დან 100-მდე.
// გააკეთე შემდეგი ნაბიჯები:

// a) filter — გაიტოვე მხოლოდ ჩაჭრილი ნიშნები (≥ 60).
// b) map — თითოეული ნიშანი გადააქციე ასო-შეფასებად (A, B, C, D).
// c) forEach — დაბეჭდე თითოეული ასო-მარკა.
// d) reduce — შეადგინე ობიექტი, რომელიც დაითვლის თითოეული ასო-შეფასების რაოდენობას.


let arr = Array.from({lenght:100},(el,i) => i+1)

let str = "DCBA"

let func1 = el => {
    if(el <= 25){
        return "D"
    } 
}

let res = arr.map( el => Math.floor())